grpc-vs-rest-observability-benchmark/load-tests/testing-results/250-RPS/gRPC.txt
========================================================================================================================
---- Global Information -------------------------------------------------------------|---Total---|-----OK----|----KO----
> request count                                                                      |    19,050 |     5,645 |    13,405
> min response time (ms)                                                             |         4 |         4 |    15,000
> max response time (ms)                                                             |    60,016 |    10,461 |    60,016
> mean response time (ms)                                                            |    18,779 |     2,134 |    25,788
> response time std deviation (ms)                                                   |    19,443 |     2,471 |    19,205
> response time 50th percentile (ms)                                                 |    15,001 |       964 |    15,001
> response time 75th percentile (ms)                                                 |    15,007 |     3,968 |    29,747
> response time 95th percentile (ms)                                                 |    60,001 |     6,776 |    60,001
> response time 99th percentile (ms)                                                 |    60,001 |     8,912 |    60,010
> mean throughput (rps)                                                              |       150 |     44.45 |    105.55
---- Response Time Distribution ----------------------------------------------------------------------------------------
> OK: t < 800 ms                                                                                          2,728 (14.32%)
> OK: 800 ms <= t < 1200 ms                                                                                 191     (1%)
> OK: t >= 1200 ms                                                                                        2,726 (14.31%)
> KO                                                                                                     13,405 (70.37%)
---- Errors ------------------------------------------------------------------------------------------------------------
> i.g.h.c.i.PrematureCloseException: Premature close                                                     10,193 (76.04%)
> Request timeout to localhost/127.0.0.1:8080 after 60000 ms                                              3,212 (23.96%)
========================================================================================================================